# Yucatan Peninsula Hurricanes

# Data Loading and Preliminary Exploration

In [1]:
# Load libraries
import pandas as pd
import numpy as np
import os
import geopandas as gpd
import matplotlib.pyplot as plt

# Load data
df = pd.read_csv('https://portal.edirepository.org/nis/dataviewer?packageid=knb-lter-hfr.71.23&entityid=ab0fe2bf4f3ad850371ccb9c69d78469')

In [2]:
df.head()

    code  start.date    end.date  number name  ss track rf.max
0  Y1852  1852-10-07  1852-10-08       5  NaN   2     O     F1
1  Y1857  1857-09-28  1857-09-28       4  NaN   2     N     F1
2  Y1861  1861-08-17  1861-08-17       2  NaN   1     O     Nd
3  Y1864  1864-08-31  1864-08-31       3  NaN   1     S     F1
4  Y1865  1865-09-11  1865-09-11       4  NaN   2     O     F1

In [3]:
df.dtypes

code          object
start.date    object
end.date      object
number         int64
name          object
ss             int64
track         object
rf.max        object
dtype: object

In [4]:
df.shape

(105, 8)

## Brainstorm

How many hurricanes with Saffir-Simpson category 5 have been registered and what was their duration?

Steps
1. Transform `start.date` and `end.date` to be type `datetime`
2. USe `.loc()` function for the `ss` column to filter for category 5 hurricanes
3. Include columns for `start.date` and `end.date`

In [15]:
url = 'https://portal.edirepository.org/nis/dataviewer?packageid=knb-lter-hfr.71.23&entityid=ab0fe2bf4f3ad850371ccb9c69d78469'

df = pd.read_csv(url,  parse_dates = ['start.date', 'end.date'])

df.loc[df['ss'] == 5].assign(duration = df['end.date'] - df['start.date'])

       code start.date   end.date  number     name  ss track rf.max duration
76   Y1955b 1955-09-28 1955-09-28      10    Janet   5     N     F3   0 days
96   Y1980a 1980-08-07 1980-08-08       1    Allen   5     O     F3   1 days
98    Y1988 1988-09-14 1988-09-15       8  Gilbert   5     N     F3   1 days
103   Y1998 1998-10-27 1998-10-28      13    Mitch   5     S     F1   1 days